docs: update conceptual model diagram to match image
